[{"_id":"65fc9fb21492af03e8f0f67b","cover":"https://docs.unity3d.com/uploads/Main/WebGLBuilding-BuildPlayerOptions.png","title":"Unity Engine WebGL","category":"Game Development","date":"2024-03-21","content":"<h2><strong>Build your WebGL application</strong></h2><p>To create a build for WebGL, go to <strong>File &gt; Build Settings</strong> from Unity’s main menu. In the Platform list, select <strong>WebGL</strong> and then click <strong>Switch Platform</strong>.</p><p>For Build Settings, refer to <a href=\"https://docs.unity3d.com/Manual/web-build-settings.html\">WebGL Build Settings</a>.</p><p>When you have configured the Build Settings, choose from one the following options:</p><ul><li><strong>Build</strong>: Builds your application into a Player.</li><li><strong>Build and Run</strong>: Builds your application in a Player, and opens that Player on your target platform.</li></ul><p><img src=\"https://docs.unity3d.com/uploads/Main/WebGLBuilding-BuildPlayerOptions.png\" alt=\"Build Settings Window\" width=\"702\" height=\"689\"></p><p>Build Settings Window</p><h2><strong>Build folder structure</strong></h2><p>The Build folder has the following files, where [ExampleBuild] represents the name of the target build folder.</p><figure class=\"table\"><table><thead><tr><th>File name</th><th>Contains</th></tr></thead><tbody><tr><td>[ExampleBuild].loader.js</td><td>The JavaScript code that the web page needs to load the Unity content.</td></tr><tr><td>[ExampleBuild].framework.js</td><td>JavaScript runtime and plugins.</td></tr><tr><td>[ExampleBuild].wasm</td><td>WebAssembly binary.</td></tr><tr><td>[ExampleBuild].mem</td><td>A binary image to initialize the heap memory for your Player. Unity generates this file for multi-threaded WebAssembly builds only.</td></tr><tr><td>[ExampleBuild].data</td><td>Asset data and <strong>Scenes</strong><br>.</td></tr><tr><td>[ExampleBuild].symbols.json</td><td>Debug symbol names necessary to demangle an error stack trace. This file is only generated for Release builds when you enable the Debug Symbols option (<strong>File</strong> &gt; <strong>Build Settings</strong> &gt; <strong>Player Settings</strong>.)</td></tr><tr><td>[ExampleBuild].jpg</td><td>A background image, which displays while the build is loading. This file is only generated when a Background Image is available in the Player Settings (<strong>File</strong> &gt; <strong>Build Settings</strong> &gt; <strong>Player Settings</strong> &gt; <strong>Splash Image</strong>). For more information, see <a href=\"https://docs.unity3d.com/Manual/class-PlayerSettingsSplashScreen.html\">Splash Screen</a>.</td></tr></tbody></table></figure><p>If you enable a <strong>Compression</strong><br><strong>Method</strong> for your build, Unity identifies the extension that corresponds with the compression method and adds this extension to the names of the files inside the Build sub folder. If you enable <strong>Decompression Fallback</strong>, Unity appends the extension .unityweb to the build file names. Otherwise, Unity appends the extension .gz for the Gzip compression method, or .br for the Brotli compression method. For more information, refer to <a href=\"https://docs.unity3d.com/Manual/webgl-deploying.html\">Compressed builds and server configuration</a>.</p><p>If you enable <strong>Name Files As Hashes</strong> in the <strong>Player Settings</strong><br>, Unity uses the hash of the file content instead of the default file name. This applies to each file in the build folder. This option allows you to upload updated versions of the game builds into the same folder on the server, and only upload the files which have changed between build iterations.</p><p><strong>Note</strong>: Opening a Player directly from the file system might not work in some browsers. This is due to security restrictions applied to local file URLs.</p><h2><strong>Enable exceptions</strong></h2><p>Use <strong>Enable Exceptions</strong> to specify how unexpected code behavior (also known as errors) is handled at runtime. To access <strong>Enable Exceptions</strong>, go to the <strong>Publishing Settings</strong> section in <strong>WebGL</strong><br>Player Settings.</p><p>It has the following options:</p><ul><li><strong>None</strong>: Select this if you don’t need any exception support. This gives the best performance and smallest builds. With this option, any exception thrown causes your content to stop with an error in that setting.</li><li><strong>Explicitly Thrown Exceptions Only</strong> (default): Select this to capture exceptions which are explicitly specified from a throw statement in your <strong>scripts</strong><br>and to also ensure finally blocks are called. Note that selecting this option makes the generated JavaScript code from your scripts longer and slower; This might only be an issue if scripts are the main bottleneck in your project.</li><li><strong>Full Without Stacktrace</strong>: Select this option to capture: * Exceptions which are explicitly specified from throw statements in your scripts (the same as in the <i>Explicitly Thrown Exceptions Only</i> option)<ul><li>Null References</li><li>Out of Bounds Array accesses</li></ul></li><li><strong>Full With Stacktrace</strong>: This option is similar to the option above but it also captures Stack traces. Unity generates these exceptions by embedding checks for them in the code, so this option decreases performance and increases browser memory usage. Only use this for debugging, and always test in a 64-bit browser.</li></ul>"},{"_id":"65fca01a1492af03e8f0f67e","cover":"https://cdn1-production-images-kly.akamaized.net/cVcTiP1JeuyL_LqqRz7U99IJZ6Q=/640x360/smart/filters:quality(75):strip_icc():format(webp)/kly-media-production/medias/4736331/original/048675100_1707214102-WhatsApp_Image_2024-02-02_at_12.51.20.jpeg","title":"Profil Isyana Sarasvati","category":"Entertaiment","date":"2024-03-21","content":"<h2><strong>Profil Isyana Sarasvati</strong></h2><p><a href=\"https://www.liputan6.com/citizen6/read/5522629/profil-dan-agama-isyana-sarasvati-penyanyi-cantik-dengan-segudang-prestasi?page=3#\"><img src=\"https://cdn1-production-images-kly.akamaized.net/hbB92z7ATLwmKbr3vIzYQzOg-cg=/640x853/smart/filters:quality(75):strip_icc():format(webp)/kly-media-production/medias/4736332/original/070558600_1707214102-WhatsApp_Image_2024-02-02_at_12.51.24.jpeg\" alt=\"Foto Isyana Sarasvati (Instagram/@isyanasarasvati)\" width=\"640\" height=\"853\"></a></p><p>&nbsp;</p><p>Foto Isyana Sarasvati (Instagram/@isyanasarasvati)</p><p>Nama Lengkap: Isyana Sarasvati</p><p>Nama Panggilan: Isyana</p><p>Tempat Lahir: Bandung</p><p>Tanggal Lahir: 2 Mei 1993</p><p>Kewarganegaraan: Indonesia</p>"},{"_id":"65fca0cf1492af03e8f0f681","cover":"https://knotfest.com/cdn/shop/articles/MAD4560-Enhanced-NR-1.jpg?v=1710433923&width=750","title":"Babymetal Drop Explosive Collab Track \"Leave It All Behind\"","category":"Music","date":"2024-03-21","content":"<p>Japanese alt metal powerhouse Babymetal have unveiled a colossal new collaboration track - one that underscores the band's international reach that transcends both generation and genre. Team with Thailand champions in rapper F. Hero and rock outfit BODYSLAM, \"Leave It All Behind\" features a multi-layered attack that touts the best of rock, pop, metal and hip hop in way that translates&nbsp;brilliantly.&nbsp;</p><p>&nbsp;</p><figure class=\"image\"><img style=\"aspect-ratio:1640/624;\" src=\"https://scontent.fbth9-1.fna.fbcdn.net/v/t39.30808-6/432005066_1030302358457465_7869539792641526985_n.jpg?_nc_cat=107&amp;ccb=1-7&amp;_nc_sid=5f2048&amp;_nc_ohc=dIdxXNN8BXAAX8XDm9_&amp;_nc_ht=scontent.fbth9-1.fna&amp;oh=00_AfBASLXG2jJBfAoso_wQp1tAWIVjwzgG7tlisU-r0G1nxw&amp;oe=66018D3A\" alt=\"May be an image of 7 people and text that says &quot;HERO BODYSLAM BABYMETAL LEAVET ALL BEHIND&quot;\" width=\"1640\" height=\"624\"></figure><p>&nbsp;</p><p>The latest anthem from Babymetal lands as the first showing in 2024, following the mammoth success of last year's \"METAL!\" collaboration with Tom Morello of Rage Against the Machine. Additionally, Babymetal would make a memorable appearance as a contributor on Lil Uzi Vert's <i>Pink Tape</i> full length.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;</p><p>Additionally, Babymetal is slated to revisit the magnitude of their 2023 co-headlining run with Dethklok for a pair of special one-off shows next month in San Francisco. The special two-night engagement precedes the band's appearance at Sick New World on April 27th in Las Vegas. From there, Babymetal will trek to Europe with appearances confirmed at Rock Im Park and Rock Am Ring in Germany as well as Download Festival in the UK this summer. See the most current list of tour dates</p>"}]